
## Plan Result (isucon)

[CI link](https://github.com/Shion1305/Shion1305-infra/actions/runs/12121592546)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 4 to change, 2 to destroy.</code></pre>

* Update
  * oci_core_public_ip.isu-1
  * oci_core_public_ip.isu-2
  * oci_core_public_ip.isu-3
  * module.private-isu2.oci_core_instance.isucon-instance
* Replace
  * module.private-isu-bench.oci_core_instance.isucon-instance
  * module.private-isu1.oci_core_instance.isucon-instance


<details><summary>Change Result (Click me)</summary>

```hcl

  # oci_core_public_ip.isu-1 will be updated in-place
  ~ resource "oci_core_public_ip" "isu-1" {
        id                   = "ocid1.publicip.oc1.ap-tokyo-1.amaaaaaaqiqkkcyapfgyqhtwlhdcth3nprzkmgnvvdukx4p7m6xuonru3aqa"
      ~ private_ip_id        = "ocid1.privateip.oc1.ap-tokyo-1.abxhiljreikfib7v6dy2ihyzu7k5xdvg5ajfz3wg4efo4lebrxrm3egf4nhq" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # oci_core_public_ip.isu-2 will be updated in-place
  ~ resource "oci_core_public_ip" "isu-2" {
        id                   = "ocid1.publicip.oc1.ap-tokyo-1.amaaaaaaqiqkkcya42i3fhgp3ythfvuv37wwya5mop37luuenyyodnam5yfq"
      ~ private_ip_id        = "ocid1.privateip.oc1.ap-tokyo-1.abxhiljru3tmanvvhtphtok27nivtansea3qd5hf7mouedmfeqp5lgq3em4a" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # oci_core_public_ip.isu-3 will be updated in-place
  ~ resource "oci_core_public_ip" "isu-3" {
        id                   = "ocid1.publicip.oc1.ap-tokyo-1.amaaaaaaqiqkkcyapuxcjw2eot72rbn4tw52v4jncvtq55gdyaadypstiehq"
      ~ private_ip_id        = "ocid1.privateip.oc1.ap-tokyo-1.abxhiljrkonj6ejehygmvniu7m3qtwwydv7hykno6uf5yalqqfxxxmh2qjpa" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.private-isu-bench.data.oci_core_private_ips.private_ips will be read during apply
  # (config refers to values not yet known)
 <= data "oci_core_private_ips" "private_ips" {
      + id          = (known after apply)
      + private_ips = (known after apply)
      + subnet_id   = "ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaaouhghd25suhw5wc5t5tmlcvmt5vsytmlzptz2ktfogapogfuikq"
      + vnic_id     = (known after apply)
    }

  # module.private-isu-bench.data.oci_core_vnic.instance_primary_vnic will be read during apply
  # (config refers to values not yet known)
 <= data "oci_core_vnic" "instance_primary_vnic" {
      + availability_domain    = (known after apply)
      + compartment_id         = (known after apply)
      + defined_tags           = (known after apply)
      + display_name           = (known after apply)
      + freeform_tags          = (known after apply)
      + hostname_label         = (known after apply)
      + id                     = (known after apply)
      + ipv6addresses          = (known after apply)
      + is_primary             = (known after apply)
      + mac_address            = (known after apply)
      + nsg_ids                = (known after apply)
      + private_ip_address     = (known after apply)
      + public_ip_address      = (known after apply)
      + security_attributes    = (known after apply)
      + skip_source_dest_check = (known after apply)
      + state                  = (known after apply)
      + subnet_id              = (known after apply)
      + time_created           = (known after apply)
      + vlan_id                = (known after apply)
      + vnic_id                = (known after apply)
    }

  # module.private-isu-bench.data.oci_core_vnic_attachments.vnic_attachments will be read during apply
  # (config refers to values not yet known)
 <= data "oci_core_vnic_attachments" "vnic_attachments" {
      + compartment_id   = "ocid1.compartment.oc1..aaaaaaaaqi757kiz665ywkitzyetl7qz5jflrs3tzta4h5ksmwoyrbbfpt7q"
      + id               = (known after apply)
      + instance_id      = (known after apply)
      + vnic_attachments = (known after apply)
    }

  # module.private-isu-bench.oci_core_instance.isucon-instance must be replaced
-/+ resource "oci_core_instance" "isucon-instance" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.ap-tokyo-1.abxhiljrtztyq5osgurjiaq4xcbmo5zronlthks6mqlcnyaqfy7jfttdggwq" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "default/shion1305@gmail.com"
          - "Oracle-Tags.CreatedOn" = "2024-11-21T20:41:37.831Z"
        } -> (known after apply)
      ~ display_name                        = "private-isu-bench" -> "private-isu-bench-1202"
      ~ extended_metadata                   = {} -> (known after apply)
      ~ freeform_tags                       = {} -> (known after apply)
      ~ hostname_label                      = "private-isu-bench" -> (known after apply)
      ~ id                                  = "ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcycxsyhvpbkw6h6n7yokjt5qpn6ah2mhldr37ov5ut3a24a" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.ap-tokyo-1.aaaaaaaadcb75lsmgfzxtrirj6l7rb7ecd4ivz7fwzi2py2kk2molifncsia" -> (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      ~ is_cross_numa_node                  = false -> (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ metadata                            = { # forces replacement
          ~ "user_data"           = "I2Nsb3VkLWNvbmZpZwoKdGltZXpvbmU6IEFzaWEvVG9reW8KcGFja2FnZV91cGRhdGU6IHRydWUKcGFja2FnZXM6CiAgLSBhbnNpYmxlCiAgLSBjdXJsCiAgLSBnaXQKcnVuY21kOgogIC0gfAogICAgc2V0IC1lCgogICAgR0lURElSPSIvdG1wL3ByaXZhdGUtaXN1IgogICAgcm0gLXJmICR7R0lURElSfQogICAgZ2l0IGNsb25lIC0tZGVwdGg9MSBodHRwczovL2dpdGh1Yi5jb20vU2hpb24xMzA1L3ByaXZhdGUtaXN1LmdpdCAke0dJVERJUn0KICAgIGNkICR7R0lURElSfS9wcm92aXNpb25pbmcvCiAgICBzZWQgLWkgJ3MvaXN1LWJlbmNoL2xvY2FsaG9zdCBhbnNpYmxlX2Nvbm5lY3Rpb249bG9jYWwvJyBob3N0cwogICAgYW5zaWJsZS1wbGF5Ym9vayAtaSBob3N0cyBiZW5jaC9hbnNpYmxlL3BsYXlib29rcy55bWwK" -> "I2Nsb3VkLWNvbmZpZwp1c2VybmFtZTogaXN1Y29uCnRpbWV6b25lOiBBc2lhL1Rva3lvCnBhY2thZ2VfdXBkYXRlOiB0cnVlCnBhY2thZ2VzOgogIC0gYW5zaWJsZQogIC0gY3VybAogIC0gZ2l0CnJ1bmNtZDoKICAtIHwKICAgIHNldCAtZQoKICAgIEdJVERJUj0iL3RtcC9wcml2YXRlLWlzdSIKICAgIHJtIC1yZiAke0dJVERJUn0KICAgIGdpdCBjbG9uZSAtLWRlcHRoPTEgaHR0cHM6Ly9naXRodWIuY29tL1NoaW9uMTMwNS9wcml2YXRlLWlzdS5naXQgJHtHSVRESVJ9CiAgICBjZCAke0dJVERJUn0vcHJvdmlzaW9uaW5nLwogICAgc2VkIC1pICdzL2lzdS1iZW5jaC9sb2NhbGhvc3QgYW5zaWJsZV9jb25uZWN0aW9uPWxvY2FsLycgaG9zdHMKICAgIGFuc2libGUtcGxheWJvb2sgLWkgaG9zdHMgYmVuY2gvYW5zaWJsZS9wbGF5Ym9va3MueW1sCg=="
            # (1 unchanged element hidden)
        }
      ~ private_ip                          = "10.0.0.161" -> (known after apply)
      ~ public_ip                           = "155.248.181.182" -> (known after apply)
      ~ region                              = "ap-tokyo-1" -> (known after apply)
      ~ security_attributes                 = {} -> (known after apply)
      ~ security_attributes_state           = "STABLE" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaaouhghd25suhw5wc5t5tmlcvmt5vsytmlzptz2ktfogapogfuikq" -> (known after apply)
      ~ system_tags                         = {} -> (known after apply)
      ~ time_created                        = "2024-11-21 20:41:38.677 +0000 UTC" -> (known after apply)
      + time_maintenance_reboot_due         = (known after apply)
        # (4 unchanged attributes hidden)

      ~ create_vnic_details {
          ~ assign_ipv6ip             = false -> (known after apply)
          - assign_private_dns_record = false -> null
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "default/shion1305@gmail.com"
              - "Oracle-Tags.CreatedOn" = "2024-11-21T20:41:37.984Z"
            } -> (known after apply)
          ~ display_name              = "private-isu-bench" -> "private-isu-bench-1202"
          ~ freeform_tags             = {} -> (known after apply)
          ~ hostname_label            = "private-isu-bench" -> (known after apply)
          ~ nsg_ids                   = [] -> (known after apply)
          ~ private_ip                = "10.0.0.161" -> (known after apply)
          ~ security_attributes       = {} -> (known after apply)
          + vlan_id                   = (known after apply)
            # (3 unchanged attributes hidden)

          ~ ipv6address_ipv6subnet_cidr_pair_details {
              + assign_ipv6ip             = (known after apply)
              + assign_private_dns_record = (known after apply)
              + assign_public_ip          = (known after apply)
              + defined_tags              = (known after apply)
              + display_name              = (known after apply)
              + freeform_tags             = (known after apply)
              + hostname_label            = (known after apply)
              + nsg_ids                   = (known after apply)
              + private_ip                = (known after apply)
              + security_attributes       = (known after apply)
              + skip_source_dest_check    = (known after apply)
              + subnet_id                 = (known after apply)
              + vlan_id                   = (known after apply)
            } -> (known after apply)
        }

      ~ launch_options {
          ~ is_pv_encryption_in_transit_enabled = false -> (known after apply)
            # (5 unchanged attributes hidden)
        }

      ~ launch_volume_attachments {
          + async                                   = (known after apply)
          + availability_domain                     = (known after apply)
          + boot_volume_id                          = (known after apply)
          + capacity_reservation_id                 = (known after apply)
          + cluster_placement_group_id              = (known after apply)
          + compartment_id                          = (known after apply)
          + compute_cluster_id                      = (known after apply)
          + dedicated_vm_host_id                    = (known after apply)
          + defined_tags                            = (known after apply)
          + display_name                            = (known after apply)
          + extended_metadata                       = (known after apply)
          + fault_domain                            = (known after apply)
          + freeform_tags                           = (known after apply)
          + hostname_label                          = (known after apply)
          + id                                      = (known after apply)
          + image                                   = (known after apply)
          + instance_configuration_id               = (known after apply)
          + ipxe_script                             = (known after apply)
          + is_cross_numa_node                      = (known after apply)
          + is_pv_encryption_in_transit_enabled     = (known after apply)
          + launch_mode                             = (known after apply)
          + metadata                                = (known after apply)
          + preserve_boot_volume                    = (known after apply)
          + preserve_data_volumes_created_at_launch = (known after apply)
          + private_ip                              = (known after apply)
          + public_ip                               = (known after apply)
          + region                                  = (known after apply)
          + security_attributes                     = (known after apply)
          + security_attributes_state               = (known after apply)
          + shape                                   = (known after apply)
          + state                                   = (known after apply)
          + subnet_id                               = (known after apply)
          + system_tags                             = (known after apply)
          + time_created                            = (known after apply)
          + time_maintenance_reboot_due             = (known after apply)
          + update_operation_constraint             = (known after apply)
        } -> (known after apply)

      ~ platform_config {
          + async                                   = (known after apply)
          + availability_domain                     = (known after apply)
          + boot_volume_id                          = (known after apply)
          + capacity_reservation_id                 = (known after apply)
          + cluster_placement_group_id              = (known after apply)
          + compartment_id                          = (known after apply)
          + compute_cluster_id                      = (known after apply)
          + dedicated_vm_host_id                    = (known after apply)
          + defined_tags                            = (known after apply)
          + display_name                            = (known after apply)
          + extended_metadata                       = (known after apply)
          + fault_domain                            = (known after apply)
          + freeform_tags                           = (known after apply)
          + hostname_label                          = (known after apply)
          + id                                      = (known after apply)
          + image                                   = (known after apply)
          + instance_configuration_id               = (known after apply)
          + ipxe_script                             = (known after apply)
          + is_cross_numa_node                      = (known after apply)
          + is_pv_encryption_in_transit_enabled     = (known after apply)
          + launch_mode                             = (known after apply)
          + metadata                                = (known after apply)
          + preserve_boot_volume                    = (known after apply)
          + preserve_data_volumes_created_at_launch = (known after apply)
          + private_ip                              = (known after apply)
          + public_ip                               = (known after apply)
          + region                                  = (known after apply)
          + security_attributes                     = (known after apply)
          + security_attributes_state               = (known after apply)
          + shape                                   = (known after apply)
          + state                                   = (known after apply)
          + subnet_id                               = (known after apply)
          + system_tags                             = (known after apply)
          + time_created                            = (known after apply)
          + time_maintenance_reboot_due             = (known after apply)
          + update_operation_constraint             = (known after apply)
        } -> (known after apply)

      ~ preemptible_instance_config {
          + async                                   = (known after apply)
          + availability_domain                     = (known after apply)
          + boot_volume_id                          = (known after apply)
          + capacity_reservation_id                 = (known after apply)
          + cluster_placement_group_id              = (known after apply)
          + compartment_id                          = (known after apply)
          + compute_cluster_id                      = (known after apply)
          + dedicated_vm_host_id                    = (known after apply)
          + defined_tags                            = (known after apply)
          + display_name                            = (known after apply)
          + extended_metadata                       = (known after apply)
          + fault_domain                            = (known after apply)
          + freeform_tags                           = (known after apply)
          + hostname_label                          = (known after apply)
          + id                                      = (known after apply)
          + image                                   = (known after apply)
          + instance_configuration_id               = (known after apply)
          + ipxe_script                             = (known after apply)
          + is_cross_numa_node                      = (known after apply)
          + is_pv_encryption_in_transit_enabled     = (known after apply)
          + launch_mode                             = (known after apply)
          + metadata                                = (known after apply)
          + preserve_boot_volume                    = (known after apply)
          + preserve_data_volumes_created_at_launch = (known after apply)
          + private_ip                              = (known after apply)
          + public_ip                               = (known after apply)
          + region                                  = (known after apply)
          + security_attributes                     = (known after apply)
          + security_attributes_state               = (known after apply)
          + shape                                   = (known after apply)
          + state                                   = (known after apply)
          + subnet_id                               = (known after apply)
          + system_tags                             = (known after apply)
          + time_created                            = (known after apply)
          + time_maintenance_reboot_due             = (known after apply)
          + update_operation_constraint             = (known after apply)
        } -> (known after apply)

      ~ shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          ~ gpus                          = 0 -> (known after apply)
          + local_disk_description        = (known after apply)
          ~ local_disks                   = 0 -> (known after apply)
          ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
          ~ max_vnic_attachments          = 2 -> (known after apply)
          ~ networking_bandwidth_in_gbps  = 1 -> (known after apply)
          ~ nvmes                         = 0 -> (known after apply)
          ~ processor_description         = "3.0 GHz Ampere® Altra™" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.private-isu1.data.oci_core_private_ips.private_ips will be read during apply
  # (config refers to values not yet known)
 <= data "oci_core_private_ips" "private_ips" {
      + id          = (known after apply)
      + private_ips = (known after apply)
      + subnet_id   = "ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaaouhghd25suhw5wc5t5tmlcvmt5vsytmlzptz2ktfogapogfuikq"
      + vnic_id     = (known after apply)
    }

  # module.private-isu1.data.oci_core_vnic.instance_primary_vnic will be read during apply
  # (config refers to values not yet known)
 <= data "oci_core_vnic" "instance_primary_vnic" {
      + availability_domain    = (known after apply)
      + compartment_id         = (known after apply)
      + defined_tags           = (known after apply)
      + display_name           = (known after apply)
      + freeform_tags          = (known after apply)
      + hostname_label         = (known after apply)
      + id                     = (known after apply)
      + ipv6addresses          = (known after apply)
      + is_primary             = (known after apply)
      + mac_address            = (known after apply)
      + nsg_ids                = (known after apply)
      + private_ip_address     = (known after apply)
      + public_ip_address      = (known after apply)
      + security_attributes    = (known after apply)
      + skip_source_dest_check = (known after apply)
      + state                  = (known after apply)
      + subnet_id              = (known after apply)
      + time_created           = (known after apply)
      + vlan_id                = (known after apply)
      + vnic_id                = (known after apply)
    }

  # module.private-isu1.data.oci_core_vnic_attachments.vnic_attachments will be read during apply
  # (config refers to values not yet known)
 <= data "oci_core_vnic_attachments" "vnic_attachments" {
      + compartment_id   = "ocid1.compartment.oc1..aaaaaaaaqi757kiz665ywkitzyetl7qz5jflrs3tzta4h5ksmwoyrbbfpt7q"
      + id               = (known after apply)
      + instance_id      = (known after apply)
      + vnic_attachments = (known after apply)
    }

  # module.private-isu1.oci_core_instance.isucon-instance must be replaced
-/+ resource "oci_core_instance" "isucon-instance" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.ap-tokyo-1.abxhiljrnd6zmeybhllwnjpojtblylrrdvvp67smqalwnf2mq2qil7z4nxbq" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "default/shion1305@gmail.com"
          - "Oracle-Tags.CreatedOn" = "2024-11-21T21:27:21.665Z"
        } -> (known after apply)
      ~ display_name                        = "private-isu1" -> "private-isu1-1202"
      ~ extended_metadata                   = {} -> (known after apply)
      ~ freeform_tags                       = {} -> (known after apply)
      ~ hostname_label                      = "private-isu1" -> (known after apply)
      ~ id                                  = "ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcycixfzbrdrfjdxbhedgqfkh7p2r5yxyboqgmvhvl7tku2a" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.ap-tokyo-1.aaaaaaaadcb75lsmgfzxtrirj6l7rb7ecd4ivz7fwzi2py2kk2molifncsia" -> (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      ~ is_cross_numa_node                  = false -> (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ metadata                            = { # forces replacement
          ~ "user_data"           = "I2Nsb3VkLWNvbmZpZwoKdGltZXpvbmU6IEFzaWEvVG9reW8KcGFja2FnZV91cGRhdGU6IHRydWUKcGFja2FnZXM6CiAgLSBhbnNpYmxlCiAgLSBjdXJsCiAgLSBnaXQKICAtIHVuemlwCnJ1bmNtZDoKICAtIHwKICAgIHNldCAtZQoKICAgIEdJVERJUj0iL3RtcC9wcml2YXRlLWlzdSIKICAgIHJtIC1yZiAke0dJVERJUn0KICAgIGdpdCBjbG9uZSAtLWRlcHRoPTEgaHR0cHM6Ly9naXRodWIuY29tL1NoaW9uMTMwNS9wcml2YXRlLWlzdS5naXQgJHtHSVRESVJ9CiAgICBjZCAke0dJVERJUn0vcHJvdmlzaW9uaW5nLwogICAgc2VkIC1pICdzL2lzdS1hcHAvbG9jYWxob3N0IGFuc2libGVfY29ubmVjdGlvbj1sb2NhbC8nIGhvc3RzCiAgICBhbnNpYmxlLXBsYXlib29rIC1pIGhvc3RzIGltYWdlL2Fuc2libGUvcGxheWJvb2tzLnltbCAtLXNraXAtdGFncyBub2RlanMK" -> "I2Nsb3VkLWNvbmZpZwp1c2VybmFtZTogaXN1Y29uCnRpbWV6b25lOiBBc2lhL1Rva3lvCnBhY2thZ2VfdXBkYXRlOiB0cnVlCnBhY2thZ2VzOgogIC0gYW5zaWJsZQogIC0gY3VybAogIC0gZ2l0CiAgLSB1bnppcApydW5jbWQ6CiAgLSB8CiAgICBzZXQgLWUKCiAgICBHSVRESVI9Ii90bXAvcHJpdmF0ZS1pc3UiCiAgICBybSAtcmYgJHtHSVRESVJ9CiAgICBnaXQgY2xvbmUgLS1kZXB0aD0xIGh0dHBzOi8vZ2l0aHViLmNvbS9TaGlvbjEzMDUvcHJpdmF0ZS1pc3UuZ2l0ICR7R0lURElSfQogICAgY2QgJHtHSVRESVJ9L3Byb3Zpc2lvbmluZy8KICAgIHNlZCAtaSAncy9pc3UtYXBwL2xvY2FsaG9zdCBhbnNpYmxlX2Nvbm5lY3Rpb249bG9jYWwvJyBob3N0cwogICAgYW5zaWJsZS1wbGF5Ym9vayAtaSBob3N0cyBpbWFnZS9hbnNpYmxlL3BsYXlib29rcy55bWwgLS1za2lwLXRhZ3Mgbm9kZWpzCg=="
            # (1 unchanged element hidden)
        }
      ~ private_ip                          = "10.0.0.11" -> (known after apply)
      ~ public_ip                           = "138.3.213.241" -> (known after apply)
      ~ region                              = "ap-tokyo-1" -> (known after apply)
      ~ security_attributes                 = {} -> (known after apply)
      ~ security_attributes_state           = "STABLE" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaaouhghd25suhw5wc5t5tmlcvmt5vsytmlzptz2ktfogapogfuikq" -> (known after apply)
      ~ system_tags                         = {} -> (known after apply)
      ~ time_created                        = "2024-11-21 21:27:22.347 +0000 UTC" -> (known after apply)
      + time_maintenance_reboot_due         = (known after apply)
        # (4 unchanged attributes hidden)

      ~ create_vnic_details {
          ~ assign_ipv6ip             = false -> (known after apply)
          - assign_private_dns_record = false -> null
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "default/shion1305@gmail.com"
              - "Oracle-Tags.CreatedOn" = "2024-11-21T21:27:21.814Z"
            } -> (known after apply)
          ~ display_name              = "private-isu1" -> "private-isu1-1202"
          ~ freeform_tags             = {} -> (known after apply)
          ~ hostname_label            = "private-isu1" -> (known after apply)
          ~ nsg_ids                   = [] -> (known after apply)
          ~ private_ip                = "10.0.0.11" -> (known after apply)
          ~ security_attributes       = {} -> (known after apply)
          + vlan_id                   = (known after apply)
            # (3 unchanged attributes hidden)

          ~ ipv6address_ipv6subnet_cidr_pair_details {
              + assign_ipv6ip             = (known after apply)
              + assign_private_dns_record = (known after apply)
              + assign_public_ip          = (known after apply)
              + defined_tags              = (known after apply)
              + display_name              = (known after apply)
              + freeform_tags             = (known after apply)
              + hostname_label            = (known after apply)
              + nsg_ids                   = (known after apply)
              + private_ip                = (known after apply)
              + security_attributes       = (known after apply)
              + skip_source_dest_check    = (known after apply)
              + subnet_id                 = (known after apply)
              + vlan_id                   = (known after apply)
            } -> (known after apply)
        }

      ~ launch_options {
          ~ is_pv_encryption_in_transit_enabled = false -> (known after apply)
            # (5 unchanged attributes hidden)
        }

      ~ launch_volume_attachments {
          + async                                   = (known after apply)
          + availability_domain                     = (known after apply)
          + boot_volume_id                          = (known after apply)
          + capacity_reservation_id                 = (known after apply)
          + cluster_placement_group_id              = (known after apply)
          + compartment_id                          = (known after apply)
          + compute_cluster_id                      = (known after apply)
          + dedicated_vm_host_id                    = (known after apply)
          + defined_tags                            = (known after apply)
          + display_name                            = (known after apply)
          + extended_metadata                       = (known after apply)
          + fault_domain                            = (known after apply)
          + freeform_tags                           = (known after apply)
          + hostname_label                          = (known after apply)
          + id                                      = (known after apply)
          + image                                   = (known after apply)
          + instance_configuration_id               = (known after apply)
          + ipxe_script                             = (known after apply)
          + is_cross_numa_node                      = (known after apply)
          + is_pv_encryption_in_transit_enabled     = (known after apply)
          + launch_mode                             = (known after apply)
          + metadata                                = (known after apply)
          + preserve_boot_volume                    = (known after apply)
          + preserve_data_volumes_created_at_launch = (known after apply)
          + private_ip                              = (known after apply)
          + public_ip                               = (known after apply)
          + region                                  = (known after apply)
          + security_attributes                     = (known after apply)
          + security_attributes_state               = (known after apply)
          + shape                                   = (known after apply)
          + state                                   = (known after apply)
          + subnet_id                               = (known after apply)
          + system_tags                             = (known after apply)
          + time_created                            = (known after apply)
          + time_maintenance_reboot_due             = (known after apply)
          + update_operation_constraint             = (known after apply)
        } -> (known after apply)

      ~ platform_config {
          + async                                   = (known after apply)
          + availability_domain                     = (known after apply)
          + boot_volume_id                          = (known after apply)
          + capacity_reservation_id                 = (known after apply)
          + cluster_placement_group_id              = (known after apply)
          + compartment_id                          = (known after apply)
          + compute_cluster_id                      = (known after apply)
          + dedicated_vm_host_id                    = (known after apply)
          + defined_tags                            = (known after apply)
          + display_name                            = (known after apply)
          + extended_metadata                       = (known after apply)
          + fault_domain                            = (known after apply)
          + freeform_tags                           = (known after apply)
          + hostname_label                          = (known after apply)
          + id                                      = (known after apply)
          + image                                   = (known after apply)
          + instance_configuration_id               = (known after apply)
          + ipxe_script                             = (known after apply)
          + is_cross_numa_node                      = (known after apply)
          + is_pv_encryption_in_transit_enabled     = (known after apply)
          + launch_mode                             = (known after apply)
          + metadata                                = (known after apply)
          + preserve_boot_volume                    = (known after apply)
          + preserve_data_volumes_created_at_launch = (known after apply)
          + private_ip                              = (known after apply)
          + public_ip                               = (known after apply)
          + region                                  = (known after apply)
          + security_attributes                     = (known after apply)
          + security_attributes_state               = (known after apply)
          + shape                                   = (known after apply)
          + state                                   = (known after apply)
          + subnet_id                               = (known after apply)
          + system_tags                             = (known after apply)
          + time_created                            = (known after apply)
          + time_maintenance_reboot_due             = (known after apply)
          + update_operation_constraint             = (known after apply)
        } -> (known after apply)

      ~ preemptible_instance_config {
          + async                                   = (known after apply)
          + availability_domain                     = (known after apply)
          + boot_volume_id                          = (known after apply)
          + capacity_reservation_id                 = (known after apply)
          + cluster_placement_group_id              = (known after apply)
          + compartment_id                          = (known after apply)
          + compute_cluster_id                      = (known after apply)
          + dedicated_vm_host_id                    = (known after apply)
          + defined_tags                            = (known after apply)
          + display_name                            = (known after apply)
          + extended_metadata                       = (known after apply)
          + fault_domain                            = (known after apply)
          + freeform_tags                           = (known after apply)
          + hostname_label                          = (known after apply)
          + id                                      = (known after apply)
          + image                                   = (known after apply)
          + instance_configuration_id               = (known after apply)
          + ipxe_script                             = (known after apply)
          + is_cross_numa_node                      = (known after apply)
          + is_pv_encryption_in_transit_enabled     = (known after apply)
          + launch_mode                             = (known after apply)
          + metadata                                = (known after apply)
          + preserve_boot_volume                    = (known after apply)
          + preserve_data_volumes_created_at_launch = (known after apply)
          + private_ip                              = (known after apply)
          + public_ip                               = (known after apply)
          + region                                  = (known after apply)
          + security_attributes                     = (known after apply)
          + security_attributes_state               = (known after apply)
          + shape                                   = (known after apply)
          + state                                   = (known after apply)
          + subnet_id                               = (known after apply)
          + system_tags                             = (known after apply)
          + time_created                            = (known after apply)
          + time_maintenance_reboot_due             = (known after apply)
          + update_operation_constraint             = (known after apply)
        } -> (known after apply)

      ~ shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          ~ gpus                          = 0 -> (known after apply)
          + local_disk_description        = (known after apply)
          ~ local_disks                   = 0 -> (known after apply)
          ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
          ~ max_vnic_attachments          = 2 -> (known after apply)
          ~ networking_bandwidth_in_gbps  = 1 -> (known after apply)
          ~ nvmes                         = 0 -> (known after apply)
          ~ processor_description         = "3.0 GHz Ampere® Altra™" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.private-isu2.data.oci_core_private_ips.private_ips will be read during apply
  # (config refers to values not yet known)
 <= data "oci_core_private_ips" "private_ips" {
      + id          = (known after apply)
      + private_ips = (known after apply)
      + subnet_id   = "ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaaouhghd25suhw5wc5t5tmlcvmt5vsytmlzptz2ktfogapogfuikq"
      + vnic_id     = (known after apply)
    }

  # module.private-isu2.data.oci_core_vnic.instance_primary_vnic will be read during apply
  # (config refers to values not yet known)
 <= data "oci_core_vnic" "instance_primary_vnic" {
      + availability_domain    = (known after apply)
      + compartment_id         = (known after apply)
      + defined_tags           = (known after apply)
      + display_name           = (known after apply)
      + freeform_tags          = (known after apply)
      + hostname_label         = (known after apply)
      + id                     = (known after apply)
      + ipv6addresses          = (known after apply)
      + is_primary             = (known after apply)
      + mac_address            = (known after apply)
      + nsg_ids                = (known after apply)
      + private_ip_address     = (known after apply)
      + public_ip_address      = (known after apply)
      + security_attributes    = (known after apply)
      + skip_source_dest_check = (known after apply)
      + state                  = (known after apply)
      + subnet_id              = (known after apply)
      + time_created           = (known after apply)
      + vlan_id                = (known after apply)
      + vnic_id                = (known after apply)
    }

  # module.private-isu2.data.oci_core_vnic_attachments.vnic_attachments will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "oci_core_vnic_attachments" "vnic_attachments" {
      + compartment_id   = "ocid1.compartment.oc1..aaaaaaaaqi757kiz665ywkitzyetl7qz5jflrs3tzta4h5ksmwoyrbbfpt7q"
      + id               = (known after apply)
      + instance_id      = "ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcyclrwm5bmk6uhxxbtjolg66cv7n3dnvrdyyy2xeo4glrwa"
      + vnic_attachments = (known after apply)
    }

  # module.private-isu2.oci_core_instance.isucon-instance will be updated in-place
  ~ resource "oci_core_instance" "isucon-instance" {
      ~ display_name                = "private-isu2" -> "private-isu2-1202"
        id                          = "ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcyclrwm5bmk6uhxxbtjolg66cv7n3dnvrdyyy2xeo4glrwa"
        # (23 unchanged attributes hidden)

      ~ create_vnic_details {
          ~ display_name              = "private-isu2" -> "private-isu2-1202"
            # (12 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

Plan: 2 to add, 4 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"run-terragrunt-plan","PRNumber":23,"Program":"tfcmt","SHA1":"f45646f66b825540c44ba13d0998a10b0d1535d0","Target":"isucon","Vars":{},"WorkflowName":"Run Plan on OCI"} -->